StefanKDS/STM32F7_BasicSystem/BasicSystem/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if (f->tail != f->head)
      {
        *p++ = f->buf[f->tail];
        f->tail++;

        if (f->tail == f->size)
        {
          f->tail = 0U;
        }
      }
      else
      {
        f->lock = 0U;
        return i;
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
  * @brief  USBH_HID_FifoWrite
  *         Write To FIFO.
  * @param  f: Fifo address
  * @param  buf: read buffer
  * @param  nbytes: number of item to write
  * @retval number of written items
  */
uint16_t USBH_HID_FifoWrite(FIFO_TypeDef *f, void *buf, uint16_t  nbytes)
{
  uint16_t i;
  uint8_t *p;

  p = (uint8_t *) buf;

  if (f->lock == 0U)
  {
    f->lock = 1U;

    for (i = 0U; i < nbytes; i++)
    {
      if ((f->head + 1U == f->tail) ||
          ((f->head + 1U == f->size) && (f->tail == 0U)))
      {
        f->lock = 0U;
        return i;
      }
      else
      {
        f->buf[f->head] = *p++;
        f->head++;

        if (f->head == f->size)
        {
          f->head = 0U;
        }
      }
    }
  }

  f->lock = 0U;

  return nbytes;
}

/**
* @brief  The function is a callback about HID Data events
*  @param  phost: Selected device
* @retval None
*/
int oldX, oldY;

#define LCD_COLOR_TRANSPARENT   ((uint32_t)0xFF000000)
#define LCD_COLOR_WHITE   ((uint32_t)0xFFFFFFFF)

__weak void USBH_HID_EventCallback(USBH_HandleTypeDef *phost)
{
	HID_TypeTypeDef devtype = USBH_HID_GetDeviceType(phost);

	if(devtype == HID_MOUSE)
	{
		BSP_LCD_SelectLayer(0);
		HID_MOUSE_Info_TypeDef *Mouse_Info;
		Mouse_Info = USBH_HID_GetMouseInfo(phost);  // Get the info
		int X_Val = Mouse_Info->x;  // get the x value
		int Y_Val = Mouse_Info->y;  // get the y value
		if (X_Val > 127) X_Val -= 255;
		if (Y_Val > 127) Y_Val -= 255;

		uint32_t oldColor = BSP_LCD_GetTextColor();

		BSP_LCD_SetTextColor(LCD_COLOR_TRANSPARENT);
		BSP_LCD_FillRect(oldX,oldY,4,4);

		oldX += X_Val;
		oldY += (Y_Val/8);

		if (oldX > 475)
			oldX = 475;
		if (oldX < 0)
			oldX = 0;
		if (oldY > 540)
			oldY = 540;
		if (oldY < 272)
			oldY = 272;

		BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
		BSP_LCD_FillRect(oldX,oldY,4,4);
		BSP_LCD_SetTextColor(oldColor);
		BSP_LCD_SelectLayer(1);

		if (Mouse_Info->buttons[0] == 1)
		{
			ReactOnClick(oldX, oldY - 272);
		}
	}
	else if (devtype == HID_KEYBOARD)
	{
		uint8_t key;

		HID_KEYBD_Info_TypeDef *Keyboard_Info;
		Keyboard_Info = USBH_HID_GetKeybdInfo(phost);

		if(Keyboard_Info!=NULL)
		{
			key=USBH_HID_GetASCIICode(Keyboard_Info);
			if(key != ' ')
			{
				ReactOnKey(key);
			}
		}
	}

}
/**
* @}
*/

/**
* @}
*/

/**
* @}
*/


/**
* @}
*/


/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
